In [2]:
import pandas as pd

    Types Of Merge Operations
    a. Inner Join
    b. Left Join  | Left Outer Join
    c. Right Join | Right Outer Join
    d. Outer Join | Full Outer Join
    e. Cross Join

In [4]:
order = pd.read_excel("sales order.xlsx", sheet_name = "Orders")
returns = pd.read_excel("sales order.xlsx", sheet_name = "Returns")

In [6]:
print(order.shape, returns.shape)

(5000, 7) (2000, 5)

In [10]:
order.head()

,Order ID,Unique ID,Customer,City,Quantity,Price,Total Sale Amount
0,NJ-2016-152156,NJ-2016-TT-107,Raymond Young,Troy,6,12.42,74.52
1,NJ-2016-138688,NJ-2016-PC-944,Helen Dean,Westfield,7,12.42,86.94
2,WA-2015-108966,WA-2015-TQ-107,Shirley Chavez,Seattle,2,16.32,32.64
3,NJ-2014-115812,NJ-2014-ZI-111,Brian Ryan,Westfield,1,12.42,12.42
4,NJ-2017-114412,NJ-2017-JR-537,Benjamin Willis,Westfield,3,17.83,53.49

In [9]:
returns.head()

         Order ID        Unique ID         Customer       City       State
0  NJ-2016-273214  NJ-ZKDFQ-821902    Raymond Young       Troy    New York
1  NJ-2016-271456  NJ-UTHRK-895117       Helen Dean  Westfield  New Jersey
2  WA-2015-451988  WA-ETBAQ-135442   Shirley Chavez    Seattle  Washington
3  NJ-2014-352961  NJ-EHGXM-601830       Brian Ryan  Westfield  New Jersey
4  NJ-2017-213231  NJ-CJFQS-287500  Benjamin Willis  Westfield  New Jersey

In [25]:
order['Order ID'].isin(returns['Order ID']).value_counts()

Order ID
False    4911
True       89
Name: count, dtype: int64

In [28]:
print(returns.columns)
print(returns.rename(columns = {"Order ID":"Invoice ID"}).columns)

Index(['Order ID', 'Unique ID', 'Customer', 'City', 'State'], dtype='object')
Index(['Invoice ID', 'Unique ID', 'Customer', 'City', 'State'], dtype='object')

    INNER JOIN

In [16]:
ij = pd.merge(left = order, right= returns, on= "Order ID", how="inner")
print(ij.shape,"\n")
print(ij.head())

(89, 11)

         Order ID     Unique ID_x     Customer_x   City_x  Quantity  Price  \
0  WA-2016-117590  NJ-TEXWY-11752   Judy Sanchez  Seattle         7  53.35
1  WA-2015-117415  NJ-QDWAV-21173  Harold Hunter  Seattle         4  12.42
2  MA-2017-120999  WA-JJEKO-18817      Lori Shaw   Lowell         7  16.32
3  NJ-2016-101343  NJ-MJQGV-20387   Sandra Hicks     Troy         1  53.35
4  MA-2017-139619  NJ-SDISO-30581    Roger Gomez   Lowell         7  16.32

   Total Sale Amount     Unique ID_y     Customer_y   City_y          State
0             373.45  NJ-TEXWY-11752   Judy Sanchez  Seattle     Washington
1              49.68  NJ-QDWAV-21173  Harold Hunter  Seattle     Washington
2             114.24  WA-JJEKO-18817      Lori Shaw   Lowell  Massachusetts
3              53.35  NJ-MJQGV-20387   Sandra Hicks     Troy       New York
4             114.24  NJ-SDISO-30581    Roger Gomez   Lowell  Massachusetts

    LEFT OUTER JOIN

In [24]:
loj = pd.merge(left = order, right= returns, on= "Order ID", how="left", suffixes=("_OrdersTable","_ReturnsTable"))
print(loj.shape,"\n")
print(loj.head())

(5000, 11)

         Order ID Unique ID_OrdersTable Customer_OrdersTable City_OrdersTable  \
0  NJ-2016-152156        NJ-2016-TT-107        Raymond Young             Troy
1  NJ-2016-138688        NJ-2016-PC-944           Helen Dean        Westfield
2  WA-2015-108966        WA-2015-TQ-107       Shirley Chavez          Seattle
3  NJ-2014-115812        NJ-2014-ZI-111           Brian Ryan        Westfield
4  NJ-2017-114412        NJ-2017-JR-537      Benjamin Willis        Westfield

   Quantity  Price  Total Sale Amount Unique ID_ReturnsTable  \
0         6  12.42              74.52                    NaN
1         7  12.42              86.94                    NaN
2         2  16.32              32.64                    NaN
3         1  12.42              12.42                    NaN
4         3  17.83              53.49                    NaN

  Customer_ReturnsTable City_ReturnsTable State
0                   NaN               NaN   NaN
1                   NaN               NaN   NaN
2                   NaN               NaN   NaN
3                   NaN               NaN   NaN
4                   NaN               NaN   NaN

    RIGHT OUTER JOIN

In [31]:
roj = pd.merge(left = order, right= returns, on= "Order ID", how="right", indicator=True)
print(roj.shape,"\n")
print(roj.head(),"\n")
roj._merge.value_counts()

(2000, 12)

         Order ID Unique ID_x Customer_x City_x  Quantity  Price  \
0  NJ-2016-273214         NaN        NaN    NaN       NaN    NaN
1  NJ-2016-271456         NaN        NaN    NaN       NaN    NaN
2  WA-2015-451988         NaN        NaN    NaN       NaN    NaN
3  NJ-2014-352961         NaN        NaN    NaN       NaN    NaN
4  NJ-2017-213231         NaN        NaN    NaN       NaN    NaN

   Total Sale Amount      Unique ID_y       Customer_y     City_y       State  \
0                NaN  NJ-ZKDFQ-821902    Raymond Young       Troy    New York
1                NaN  NJ-UTHRK-895117       Helen Dean  Westfield  New Jersey
2                NaN  WA-ETBAQ-135442   Shirley Chavez    Seattle  Washington
3                NaN  NJ-EHGXM-601830       Brian Ryan  Westfield  New Jersey
4                NaN  NJ-CJFQS-287500  Benjamin Willis  Westfield  New Jersey

       _merge
0  right_only
1  right_only
2  right_only
3  right_only
4  right_only

_merge
right_only    1911
both            89
left_only        0
Name: count, dtype: int64

    FULL OUTER JOIN

In [32]:
fj = pd.merge(left = order, right= returns, on= "Order ID", how="outer", indicator=True)
print(fj.shape,"\n")
print(fj.head(),"\n")
fj._merge.value_counts()

(6911, 12)

         Order ID     Unique ID_x     Customer_x       City_x  Quantity  \
0  CA-2014-100881  CA-2014-WL-316  Dennis Fields  Los Angeles       5.0
1  CA-2014-101175  CA-2014-LA-854  Angela Fowler  Los Angeles       4.0
2  CA-2014-101602  CA-2014-DW-982  Anthony White  Los Angeles       2.0
3  CA-2014-101833  CA-2014-MF-854    Adam Martin  Los Angeles       5.0
4  CA-2014-103086  CA-2014-PK-483  Joan Robinson  Los Angeles       9.0

   Price  Total Sale Amount Unique ID_y Customer_y City_y State     _merge
0  53.35             266.75         NaN        NaN    NaN   NaN  left_only
1  17.83              71.32         NaN        NaN    NaN   NaN  left_only
2  17.83              35.66         NaN        NaN    NaN   NaN  left_only
3  17.83              89.15         NaN        NaN    NaN   NaN  left_only
4  12.42             111.78         NaN        NaN    NaN   NaN  left_only

_merge
left_only     4911
right_only    1911
both            89
Name: count, dtype: int64

    CROSS JOIN

In [41]:
cj = pd.merge(left = order, right= returns, how="cross", indicator=True)
print(cj.shape,"\n")
print(cj.head(),"\n")
print(cj[cj._merge.isin(["left_only","right_only"])].shape,"-- No Values Present in Left only and Right only, however 13 cols present")

(10000000, 13)

       Order ID_x     Unique ID_x     Customer_x City_x  Quantity  Price  \
0  NJ-2016-152156  NJ-2016-TT-107  Raymond Young   Troy         6  12.42
1  NJ-2016-152156  NJ-2016-TT-107  Raymond Young   Troy         6  12.42
2  NJ-2016-152156  NJ-2016-TT-107  Raymond Young   Troy         6  12.42
3  NJ-2016-152156  NJ-2016-TT-107  Raymond Young   Troy         6  12.42
4  NJ-2016-152156  NJ-2016-TT-107  Raymond Young   Troy         6  12.42

   Total Sale Amount      Order ID_y      Unique ID_y       Customer_y  \
0              74.52  NJ-2016-273214  NJ-ZKDFQ-821902    Raymond Young
1              74.52  NJ-2016-271456  NJ-UTHRK-895117       Helen Dean
2              74.52  WA-2015-451988  WA-ETBAQ-135442   Shirley Chavez
3              74.52  NJ-2014-352961  NJ-EHGXM-601830       Brian Ryan
4              74.52  NJ-2017-213231  NJ-CJFQS-287500  Benjamin Willis

      City_y       State _merge
0       Troy    New York   both
1  Westfield  New Jersey   both
2    Seattle  Washington   both
3  Westfield  New Jersey   both
4  Westfield  New Jersey   both

(0, 13) -- No Values Present in Left only and Right only, however 13 cols present

In [47]:
subset = pd.merge(order[:5],returns[:5], how="cross", indicator=True)
print(subset.shape,"-- 25 rows since only 5 rows from both tables were selected. but 13 cols exists in both tables")

(25, 13) -- 25 rows since only 5 rows from both tables were selected. but 13 cols exists in both tables

    JOINING BASED ON INDEXES

In [57]:
emp = pd.read_clipboard()
emp.set_index("EmpID",inplace=True)
print(emp)

         Name  Age  Experience
EmpID
111      Amit   31           5
222     Jeena   31           2
333      John   36           4
444     Vivek   35           9
555      Luke   40           6
666    Harris   36           1
777    Warner   32           3
888    Dravid   34           1
999     Rahul   37           8

In [58]:
salary = pd.read_clipboard()
salary.set_index("EmpID",inplace=True)
print(salary)

       Salary  Increment
EmpID
111     76804       8448
222     70350       8442
333     86907       9559
444     77576       7757
555     59766       5976
666     55001       4950
777     55673       5010
888     54940       5494
999     78865       7886

In [59]:
pd.merge(emp,salary,left_index=True,right_index=True)

         Name  Age  Experience  Salary  Increment
EmpID
111      Amit   31           5   76804       8448
222     Jeena   31           2   70350       8442
333      John   36           4   86907       9559
444     Vivek   35           9   77576       7757
555      Luke   40           6   59766       5976
666    Harris   36           1   55001       4950
777    Warner   32           3   55673       5010
888    Dravid   34           1   54940       5494
999     Rahul   37           8   78865       7886

In [61]:
city = pd.read_clipboard()
print(city)

   EmpID           City
0    111            Goa
1    222  New York City
2    333           Troy
3    444         Mumbai
4    555        Chennai
5    666          Delhi
6    777        Gurgaon
7    888          Noida
8    999       Portland

In [63]:
# merging based on index and row col match
pd.merge(emp, city, left_index=True, right_on="EmpID")

     Name  Age  Experience  EmpID           City
0    Amit   31           5    111            Goa
1   Jeena   31           2    222  New York City
2    John   36           4    333           Troy
3   Vivek   35           9    444         Mumbai
4    Luke   40           6    555        Chennai
5  Harris   36           1    666          Delhi
6  Warner   32           3    777        Gurgaon
7  Dravid   34           1    888          Noida
8   Rahul   37           8    999       Portland

In [72]:
emp=emp.reset_index()
salary=salary.reset_index()
city=city.reset_index()

    JOINING MULTIPLE TABLES - A,B,C,D
    JOIN A+B:AB
    JOIN AB+C:ABC
    JOIN ABC+D:ABCD

In [77]:
print("EMPLOYEE TABLE \n",emp,"\n")
print("SALARY TABLE \n",salary,"\n")
print("CITY TABLE \n",city,"\n")
EmpSal = pd.merge(emp,salary,on="EmpID",how="outer")
print("EMPLOYEE-SALARY Table (joined)\n",EmpSal,"\n")
EmpSalCity = pd.merge(EmpSal,city,on="EmpID",how="outer")
print("EMPLOYEE-SALARY-CITY Table (joined)\n",EmpSalCity,"\n")

EMPLOYEE TABLE
    EmpID    Name  Age  Experience
0    111    Amit   31           5
1    222   Jeena   31           2
2    333    John   36           4
3    444   Vivek   35           9
4    555    Luke   40           6
5    666  Harris   36           1
6    777  Warner   32           3
7    888  Dravid   34           1
8    999   Rahul   37           8

SALARY TABLE
    EmpID  Salary  Increment
0    111   76804       8448
1    222   70350       8442
2    333   86907       9559
3    444   77576       7757
4    555   59766       5976
5    666   55001       4950
6    777   55673       5010
7    888   54940       5494
8    999   78865       7886

CITY TABLE
    index  EmpID           City
0      0    111            Goa
1      1    222  New York City
2      2    333           Troy
3      3    444         Mumbai
4      4    555        Chennai
5      5    666          Delhi
6      6    777        Gurgaon
7      7    888          Noida
8      8    999       Portland

EMPLOYEE-SALARY Table (joined)
    EmpID    Name  Age  Experience  Salary  Increment
0    111    Amit   31           5   76804       8448
1    222   Jeena   31           2   70350       8442
2    333    John   36           4   86907       9559
3    444   Vivek   35           9   77576       7757
4    555    Luke   40           6   59766       5976
5    666  Harris   36           1   55001       4950
6    777  Warner   32           3   55673       5010
7    888  Dravid   34           1   54940       5494
8    999   Rahul   37           8   78865       7886

EMPLOYEE-SALARY-CITY Table (joined)
    EmpID    Name  Age  Experience  Salary  Increment  index           City
0    111    Amit   31           5   76804       8448      0            Goa
1    222   Jeena   31           2   70350       8442      1  New York City
2    333    John   36           4   86907       9559      2           Troy
3    444   Vivek   35           9   77576       7757      3         Mumbai
4    555    Luke   40           6   59766       5976      4        Chennai
5    666  Harris   36           1   55001       4950      5          Delhi
6    777  Warner   32           3   55673       5010      6        Gurgaon
7    888  Dravid   34           1   54940       5494      7          Noida
8    999   Rahul   37           8   78865       7886      8       Portland

    APPENDING DATAFRAME

In [84]:
read1 = pd.read_clipboard()
emp1 = pd.DataFrame(read1)
print(emp1)

   EmpID    Name  Age  Experience
0    111    Amit   31           5
1    222   Jeena   31           2
2    333    John   36           4
3    444   Vivek   35           9
4    555    Luke   40           6
5    666  Harris   36           1
6    777  Warner   32           3
7    888  Dravid   34           1
8    999   Rahul   37           8

In [85]:
read2 = pd.read_clipboard()
emp2 = pd.DataFrame(read2)
print(emp2)

   EmpID       Name  Age  Experience
0     11    Raymond   92           7
1     22      Helen   97           1
2     33    Shirley   67           5
3     44      Brian   36           9
4     55   Benjamin   56           9
5     66      Annie   61           3
6     77  Christina   24           6
7     88      Annie   59           4
8     99       Ruby   88           4

In [87]:
read3 = pd.read_clipboard()
emp3 = pd.DataFrame(read3)
print(emp3)

   EmpID         Name  Age  Experience
0      1      Kathryn   91           4
1      2  Christopher   94           5
2      3       Walter   91           2
3      4       Pamela   33           2
4      5       Gloria   70           5
5      6       Harold   45           5
6      7         Judy   56           7
7      8       Harold   51           5
8      9         Lori   63           9

In [91]:
EMPcombined = pd.concat([emp1,emp2])
print(EMPcombined)

   EmpID       Name  Age  Experience
0    111       Amit   31           5
1    222      Jeena   31           2
2    333       John   36           4
3    444      Vivek   35           9
4    555       Luke   40           6
5    666     Harris   36           1
6    777     Warner   32           3
7    888     Dravid   34           1
8    999      Rahul   37           8
0     11    Raymond   92           7
1     22      Helen   97           1
2     33    Shirley   67           5
3     44      Brian   36           9
4     55   Benjamin   56           9
5     66      Annie   61           3
6     77  Christina   24           6
7     88      Annie   59           4
8     99       Ruby   88           4

In [95]:
#concatenate with indexes in sequence
EmployeeDB = pd.concat([EMPcombined,emp3],ignore_index=True)
print(EmployeeDB)

    EmpID         Name  Age  Experience
0     111         Amit   31           5
1     222        Jeena   31           2
2     333         John   36           4
3     444        Vivek   35           9
4     555         Luke   40           6
5     666       Harris   36           1
6     777       Warner   32           3
7     888       Dravid   34           1
8     999        Rahul   37           8
9      11      Raymond   92           7
10     22        Helen   97           1
11     33      Shirley   67           5
12     44        Brian   36           9
13     55     Benjamin   56           9
14     66        Annie   61           3
15     77    Christina   24           6
16     88        Annie   59           4
17     99         Ruby   88           4
18      1      Kathryn   91           4
19      2  Christopher   94           5
20      3       Walter   91           2
21      4       Pamela   33           2
22      5       Gloria   70           5
23      6       Harold   45           5
24      7         Judy   56           7
25      8       Harold   51           5
26      9         Lori   63           9